# Data Acquisition

Importing libraries

In [126]:
import sqlalchemy
import pandas as pd
import numpy as np

Engine

In [127]:
engine = sqlalchemy.create_engine("sqlite:///../data/raw/nicolascortinas.db")

Getting all three tables: business_info, personal_info, rank_info

In [154]:
b = pd.read_sql_table("business_info", engine)
p = pd.read_sql_table("personal_info", engine)
r = pd.read_sql_table("rank_info", engine)

In [129]:
p = pd.read_sql_table("personal_info", engine)
p

,id,lastName,age,Unnamed: 0,gender,country,image
0,7468,bEZOS,54 years old,52,Male,USA,https://specials-images.forbesimg.com/imageser...
1,4605,gATEs,62 years old,53,Male,None,https://specials-images.forbesimg.com/imageser...
2,7368,bufFETt,87 years old,54,Male,None,https://specials-images.forbesimg.com/imageser...
3,3808,arnAULT,69 years old,55,None,None,https://specials-images.forbesimg.com/imageser...
4,3213,zuckERBERg,1985,56,Male,None,https://specials-images.forbesimg.com/imageser...
...,...,...,...,...,...,...,...
2203,7578,zhAO,51 years old,2255,Male,China,https://specials-images.forbesimg.com/imageser...
2204,9196,zHOU,55 years old,2256,Male,None,https://specials-images.forbesimg.com/imageser...
2205,1175,zHU,51 years old,2257,None,China,https://specials-images.forbesimg.com/imageser...
2206,9466,zhUO,52 years old,2258,F,None,https://specials-images.forbesimg.com/imageser...
2207,2718,zoRLU,54 years old,2259,None,None,https://specials-images.forbesimg.com/imageser...

Data Wrangling -> business_info table

In [130]:
# Making a copy, just in case
b_original = b.copy()
b.head()

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,7468,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,NaN,1
1,4605,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,NaN,2
2,7368,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,NaN,3
3,3808,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,NaN,4
4,3213,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,NaN,5

In [131]:
# Splitting Source column into two columns, Sector and Company
b["Sector"] = b["Source"].str.split("==>").apply(lambda x: x[0]).apply(str.strip)
b["Company"] = b["Source"].str.split("==>").apply(lambda x: x[1]).apply(str.strip)
b.head()

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition,Sector,Company
0,7468,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,NaN,1,Technology,Amazon
1,4605,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,NaN,2,Technology,Microsoft
2,7368,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,NaN,3,Finance and Investments,Berkshire Hathaway
3,3808,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,NaN,4,Fashion & Retail,LVMH
4,3213,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,NaN,5,Technology,Facebook

In [132]:
# Replacing "" BUSD" with "" and converting it into a float type
b["Worth(BUSD)"] = b["worth"].str.replace(" BUSD", "").astype("float")
b.head()

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition,Sector,Company,Worth(BUSD)
0,7468,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,NaN,1,Technology,Amazon,112.0
1,4605,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,NaN,2,Technology,Microsoft,90.0
2,7368,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,NaN,3,Finance and Investments,Berkshire Hathaway,84.0
3,3808,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,NaN,4,Fashion & Retail,LVMH,72.0
4,3213,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,NaN,5,Technology,Facebook,71.0

In [133]:
# Dropping unnecessary columns
b.drop(columns=["Unnamed: 0", "worthChange", "realTimeWorth", "realTimePosition", "Source", "worth"], axis=1, inplace=True)
b.head()

     id                   Sector             Company  Worth(BUSD)
0  7468               Technology              Amazon        112.0
1  4605               Technology           Microsoft         90.0
2  7368  Finance and Investments  Berkshire Hathaway         84.0
3  3808         Fashion & Retail                LVMH         72.0
4  3213               Technology            Facebook         71.0

In [134]:
# Sorting by Worth column in ascending order. 
b.sort_values(by="Worth(BUSD)", ascending=False, inplace=True)

In [135]:
b.to_csv("../data/processed/business_info.csv", index=False)

Data Wrangling -> personal_info table

In [136]:
# Making a copy, just in case
p_original = p.copy()
p.head()

,id,lastName,age,Unnamed: 0,gender,country,image
0,7468,bEZOS,54 years old,52,Male,USA,https://specials-images.forbesimg.com/imageser...
1,4605,gATEs,62 years old,53,Male,None,https://specials-images.forbesimg.com/imageser...
2,7368,bufFETt,87 years old,54,Male,None,https://specials-images.forbesimg.com/imageser...
3,3808,arnAULT,69 years old,55,None,None,https://specials-images.forbesimg.com/imageser...
4,3213,zuckERBERg,1985,56,Male,None,https://specials-images.forbesimg.com/imageser...

In [137]:
# Replacing strings from the age series
p["age"] = p["age"].str.replace(" years old", "")

In [138]:
# Function, turn year of birth into age.
def bday(x):
    if x == None:
        return None
    elif len(x) == 4:
        return str(2018 - int(x))
    else:
        return x[0:2]

In [139]:
# applying bday function
p["age"] = p["age"].apply(bday)
p.head()

,id,lastName,age,Unnamed: 0,gender,country,image
0,7468,bEZOS,54,52,Male,USA,https://specials-images.forbesimg.com/imageser...
1,4605,gATEs,62,53,Male,None,https://specials-images.forbesimg.com/imageser...
2,7368,bufFETt,87,54,Male,None,https://specials-images.forbesimg.com/imageser...
3,3808,arnAULT,69,55,None,None,https://specials-images.forbesimg.com/imageser...
4,3213,zuckERBERg,33,56,Male,None,https://specials-images.forbesimg.com/imageser...

In [140]:
# Cleaning gender series. Turn F into Female, M into Male and None string into actual None.
new_sex = {"F": "Female", "Female": "Female", "M": "Male", "Male": "Male", "None": None, None: None}
p["gender"] = p["gender"].map(new_sex)
p.head()

,id,lastName,age,Unnamed: 0,gender,country,image
0,7468,bEZOS,54,52,Male,USA,https://specials-images.forbesimg.com/imageser...
1,4605,gATEs,62,53,Male,None,https://specials-images.forbesimg.com/imageser...
2,7368,bufFETt,87,54,Male,None,https://specials-images.forbesimg.com/imageser...
3,3808,arnAULT,69,55,None,None,https://specials-images.forbesimg.com/imageser...
4,3213,zuckERBERg,33,56,Male,None,https://specials-images.forbesimg.com/imageser...

In [141]:
# Deleting unnecessary columns. 
p.drop(columns=["lastName", "Unnamed: 0"], axis=1, inplace=True)
p.head()

     id age gender country                                              image
0  7468  54   Male     USA  https://specials-images.forbesimg.com/imageser...
1  4605  62   Male    None  https://specials-images.forbesimg.com/imageser...
2  7368  87   Male    None  https://specials-images.forbesimg.com/imageser...
3  3808  69   None    None  https://specials-images.forbesimg.com/imageser...
4  3213  33   Male    None  https://specials-images.forbesimg.com/imageser...

In [142]:
# Switching some countries names to improve data consistency
p["country"].replace({"None": None}, inplace=True)
p["country"].replace({"UAE": "United Arab Emirates"}, inplace=True)
p["country"].replace({"UK": "United Kingdom"}, inplace=True)
p["country"].replace({"USA": "United States"}, inplace=True)
p["country"].replace({"People's Republic of China": "China"}, inplace=True)
p.head()

,id,age,gender,country,image
0,7468,54,Male,United States,https://specials-images.forbesimg.com/imageser...
1,4605,62,Male,None,https://specials-images.forbesimg.com/imageser...
2,7368,87,Male,None,https://specials-images.forbesimg.com/imageser...
3,3808,69,None,None,https://specials-images.forbesimg.com/imageser...
4,3213,33,Male,None,https://specials-images.forbesimg.com/imageser...

In [143]:
p.to_csv("../data/processed/personal_info.csv", index=False)

Data Wrangling -> rank_info table

In [155]:
r

        id                         name  position  Unnamed: 0
0     3705  ananT ASAVABHOKHIN & FAMILY       NaN           0
1     9321               ARASH FERDowsi       NaN           1
2     4524     banthOON LAMSAM & family       NaN           2
3     4810       biLL ADDERLEY & FAmily       NaN           3
4     2336            boris ZINGAREVIch       NaN           4
...    ...                          ...       ...         ...
2255  7578               zhao XIAOQIANg    2204.0        2255
2256  9196              zhou liANGZHang    2205.0        2256
2257  1175                 zhu xiNGming    2206.0        2257
2258  9466                     zHUO JUn    2207.0        2258
2259  2718                  olguN ZORLu    2208.0        2259

[2260 rows x 4 columns]

In [156]:
# Removing unnecessary columns
r.drop(columns=["position", "Unnamed: 0"], axis=1, inplace=True)
r.head()

     id                         name
0  3705  ananT ASAVABHOKHIN & FAMILY
1  9321               ARASH FERDowsi
2  4524     banthOON LAMSAM & family
3  4810       biLL ADDERLEY & FAmily
4  2336            boris ZINGAREVIch

In [157]:
# Formatting all names to title case style
r["name"] = r["name"].str.title()
r.head()

     id                         name
0  3705  Anant Asavabhokhin & Family
1  9321               Arash Ferdowsi
2  4524     Banthoon Lamsam & Family
3  4810       Bill Adderley & Family
4  2336            Boris Zingarevich

In [168]:
r.loc[r.loc[r["name"]=="Charles Cohen"].index, "name"] = "Charles S. Cohen"

In [147]:
r.to_csv("../data/processed/rank_info.csv", index=False)

Putting it all together

In [117]:
pr = pd.merge(p,r,how="inner",on="id")
pr.head()

,id,age,gender,country,image,name
0,7468,54,Male,United States,https://specials-images.forbesimg.com/imageser...,Jeff Bezos
1,4605,62,Male,None,https://specials-images.forbesimg.com/imageser...,Bill Gates
2,7368,87,Male,None,https://specials-images.forbesimg.com/imageser...,Warren Buffett
3,3808,69,None,None,https://specials-images.forbesimg.com/imageser...,Bernard Arnault
4,3213,33,Male,None,https://specials-images.forbesimg.com/imageser...,Mark Zuckerberg

In [118]:
pr = pr[['id', 'name', 'age', 'gender', 'country', 'image']]
pr.head()

,id,name,age,gender,country,image
0,7468,Jeff Bezos,54,Male,United States,https://specials-images.forbesimg.com/imageser...
1,4605,Bill Gates,62,Male,None,https://specials-images.forbesimg.com/imageser...
2,7368,Warren Buffett,87,Male,None,https://specials-images.forbesimg.com/imageser...
3,3808,Bernard Arnault,69,None,None,https://specials-images.forbesimg.com/imageser...
4,3213,Mark Zuckerberg,33,Male,None,https://specials-images.forbesimg.com/imageser...

In [148]:
prb = pd.merge(pr,b,how="inner",on="id")
prb

,id,name,age,gender,country,image,Sector,Company,Worth(BUSD)
0,7468,Jeff Bezos,54,Male,United States,https://specials-images.forbesimg.com/imageser...,Technology,Amazon,112.0
1,4605,Bill Gates,62,Male,None,https://specials-images.forbesimg.com/imageser...,Technology,Microsoft,90.0
2,7368,Warren Buffett,87,Male,None,https://specials-images.forbesimg.com/imageser...,Finance and Investments,Berkshire Hathaway,84.0
3,3808,Bernard Arnault,69,None,None,https://specials-images.forbesimg.com/imageser...,Fashion & Retail,LVMH,72.0
4,3213,Mark Zuckerberg,33,Male,None,https://specials-images.forbesimg.com/imageser...,Technology,Facebook,71.0
...,...,...,...,...,...,...,...,...,...
2203,7578,Zhao Xiaoqiang,51,Male,China,https://specials-images.forbesimg.com/imageser...,Fashion & Retail,"fashion, entertainment",1.0
2204,9196,Zhou Liangzhang,55,Male,None,https://specials-images.forbesimg.com/imageser...,Manufacturing,electrical equipment,1.0
2205,1175,Zhu Xingming,51,None,China,https://specials-images.forbesimg.com/imageser...,Manufacturing,electrical equipment,1.0
2206,9466,Zhuo Jun,52,Female,None,https://specials-images.forbesimg.com/imageser...,Manufacturing,printed circuit boards,1.0
2207,2718,Olgun Zorlu,54,None,None,https://specials-images.forbesimg.com/imageser...,Diversified,diversified,1.0

In [120]:
prb.to_csv("../data/processed/dataclean_info.csv", index=False)